PRIMERA PARTE
 1. Obtén los clientes de brasil
 2. Obtén los empleados que son agentes de ventas
 3. Obtén las canciones de ‘AC/DC’
 4. Obtén los campos de los clientes que no sean de USA: Nombre completo, ID, País
 5. Obtén los empleados que son agentes de ventas: Nombre completo, Dirección
 (Ciudad, Estado, País) y email
 6. Obtén una lista con los países no repetidos a los que se han emitido facturas
 7. Obtén una lista con los estados de USA no repetidos de donde son los clientes y
 cuántos clientes en cada uno.
 8. Cuántos artículos tiene la factura 37
 9. Cuántas canciones tiene ‘AC/DC’
 10. Cuántos artículos tiene cada factura
 11. Cuántas facturas hay de cada país
 12. Cuántas facturas ha habido en 2009 y 2011
 13. Cuántas facturas ha habido entre 2009 y 2011
 14. Cuántas clientes hay de España y de Brasil
 15. Obtén las canciones que su título empieza por ‘You’
SEGUNDAPARTE
 1. Facturas de Clientes de Brasil, Nombre del cliente, Id de factura, fecha de la
 factura y el país de la factura
 2. Obtén cada factura asociada a cada agente de ventas con su nombre completo
 3. Obtén el nombre del cliente, el país, el nombre del agente y el total
 4. Obtén cada artículo de la factura con el nombre de la canción
 5. Muestra todas las canciones con su nombre, formato, álbum y género
 6. Cuántas canciones hay en cada playlist
 7. Cuánto ha vendido cada empleado
 8. ¿Quién ha sido el agente de ventas que más ha vendido en 2009
9. ¿Cuáles son los 3 grupos que más han vendido?

In [1]:
import pandas as pd
import sqlite3

In [2]:
import os
os.getcwd()

'c:\\Users\\Ana\\TheBridge\\2503_dsft_thebridge_ana\\2-Data_Analysis\\8-BBDD\\SQL\\Teoria\\SQL_Python'

In [3]:
# Conectamos con la base de datos chinook.db
connection = sqlite3.connect("data/chinook.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

In [4]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [5]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0])

albums
sqlite_sequence
artists
customers
employees
genres
invoices
invoice_items
media_types
playlists
playlist_track
tracks
sqlite_stat1
films

In [6]:

sql_query("SELECT name FROM sqlite_master WHERE type='table'")

               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1
13            films

In [8]:
##1. Obtén los clientes de brasil
#pd.read_sql_query("SELECT * FROM tracks;", connection)

pd.read_sql_query("select * from customers where country = 'Brazil';" , connection)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,+55 (11) 3033-4564,eduardo@woodstock.com.br,4
2,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,+55 (11) 3055-8131,alero@uol.com.br,5
3,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,+55 (21) 2271-7070,roberto.almeida@riotur.gov.br,3
4,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4

In [9]:
#2. Obtén los empleados que son agentes de ventas
pd.read_sql_query("select * from employees where title = 'Sales Support Agent';" , connection)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,3,Peacock,Jane,Sales Support Agent,2,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
1,4,Park,Margaret,Sales Support Agent,2,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
2,5,Johnson,Steve,Sales Support Agent,2,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [10]:
#3. Obtén las canciones de ‘AC/DC’
pd.read_sql_query("select * from tracks where composer = 'AC/DC';" , connection)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,15,Go Down,4,1,1,AC/DC,331180,10847611,0.99
1,16,Dog Eat Dog,4,1,1,AC/DC,215196,7032162,0.99
2,17,Let There Be Rock,4,1,1,AC/DC,366654,12021261,0.99
3,18,Bad Boy Boogie,4,1,1,AC/DC,267728,8776140,0.99
4,19,Problem Child,4,1,1,AC/DC,325041,10617116,0.99
5,20,Overdose,4,1,1,AC/DC,369319,12066294,0.99
6,21,Hell Ain't A Bad Place To Be,4,1,1,AC/DC,254380,8331286,0.99
7,22,Whole Lotta Rosie,4,1,1,AC/DC,323761,10547154,0.99

In [ ]:
#4. Obtén los campos de los clientes que no sean de USA: Nombre completo, ID, País
pd.read_sql_query("select customerid, firstname, lastname, country from customers where country = 'USA';" , connection)

    CustomerId FirstName    LastName Country
0           16     Frank      Harris     USA
1           17      Jack       Smith     USA
2           18  Michelle      Brooks     USA
3           19       Tim       Goyer     USA
4           20       Dan      Miller     USA
5           21     Kathy       Chase     USA
6           22   Heather     Leacock     USA
7           23      John      Gordon     USA
8           24     Frank     Ralston     USA
9           25    Victor     Stevens     USA
10          26   Richard  Cunningham     USA
11          27   Patrick        Gray     USA
12          28     Julia     Barnett     USA

In [14]:
#5.Obtén los empleados que son agentes de ventas: Nombre completo, Dirección
 #(Ciudad, Estado, País) y email

pd.read_sql_query("Select LASTNAME, FIRSTNAME, city, state, COUNTRY, email from employees where title = 'Sales Support Agent';" , connection)

  LastName FirstName     City State Country                     Email
0  Peacock      Jane  Calgary    AB  Canada      jane@chinookcorp.com
1     Park  Margaret  Calgary    AB  Canada  margaret@chinookcorp.com
2  Johnson     Steve  Calgary    AB  Canada     steve@chinookcorp.com

In [16]:
#6. Obtén una lista con los países no repetidos a los que se han emitido facturas

pd.read_sql_query("Select distinct billingcountry from invoices;" , connection)

    BillingCountry
0          Germany
1           Norway
2          Belgium
3           Canada
4              USA
5           France
6          Ireland
7   United Kingdom
8        Australia
9            Chile
10           India
11          Brazil
12        Portugal
13     Netherlands
14           Spain
15          Sweden
16  Czech Republic
17         Finland
18         Denmark
19           Italy
20          Poland
21         Austria
22         Hungary
23       Argentina

In [6]:
##7. Obtén una lista con los estados de USA no repetidos de donde son los clientes y
 #cuántos clientes en cada uno.

pd.read_sql_query("Select state, count(customerid) as num_cliente from customers where country ='USA' group by state;" , connection)

   State  num_cliente
0     AZ            1
1     CA            3
2     FL            1
3     IL            1
4     MA            1
5     NV            1
6     NY            1
7     TX            1
8     UT            1
9     WA            1
10    WI            1

In [19]:
#8.Cuántos artículos tiene la factura 37

pd.read_sql_query("Select COUNT (invoicelineid) AS cant FROM invoice_itemS WHERE invoiceId = 37;" , connection)

   cant
0     4

In [22]:
#9. Cuántas canciones tiene ‘AC/DC’

pd.read_sql_query("Select COUNT (trackid) AS canciones FROM tracks WHERE composer = 'AC/DC';" , connection)

   canciones
0          8

In [24]:
## 10. Cuántos artículos tiene cada factura

pd.read_sql_query("Select invoiceid, COUNT (invoicelineid) AS articulos FROM invoice_items group by invoiceid;" , connection)

     InvoiceId  articulos
0            1          2
1            2          4
2            3          6
3            4          9
4            5         14
..         ...        ...
407        408          4
408        409          6
409        410          9
410        411         14
411        412          1

[412 rows x 2 columns]

In [8]:
##11.Cuántas facturas hay de cada país

pd.read_sql_query("Select billingcountry,  count(invoiceid) as facturas FROM invoices group by  billingcountry order by facturas desc;" , connection)

    BillingCountry  facturas
0              USA        91
1           Canada        56
2           France        35
3           Brazil        35
4          Germany        28
5   United Kingdom        21
6         Portugal        14
7   Czech Republic        14
8            India        13
9           Sweden         7
10           Spain         7
11          Poland         7
12          Norway         7
13     Netherlands         7
14           Italy         7
15         Ireland         7
16         Hungary         7
17         Finland         7
18         Denmark         7
19           Chile         7
20         Belgium         7
21         Austria         7
22       Australia         7
23       Argentina         7

In [41]:
##12 Cuántas facturas ha habido en 2009 y 2011
pd.read_sql_query("Select strftime('%Y', invoicedate) as año, count(*) as invoices from invoices where año in ('2009', '2011') group by año;" , connection)

    año  invoices
0  2009        83
1  2011        83

In [45]:
#13Cuántas facturas ha habido entre 2009 y 2011
pd.read_sql_query("Select count(*) as invoices from invoices where strftime ('%Y', invoicedate) between '2009' and '2011';" , connection)

   invoices
0       249

In [ ]:
##14 Cuántas clientes hay en España y de Brasil

pd.read_sql_query("select country, COUNT(CUSTOMERID) AS CLIENTES from customers where COUNTRY in ('Spain','Brazil') group by country;", connection)

  Country  CLIENTES
0  Brazil         5
1   Spain         1

In [17]:
# Ejemplo de querys
query = """
select * from employees where title = 'Sales Support Agent'
"""

pd.read_sql_query(query, connection)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,3,Peacock,Jane,Sales Support Agent,2,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
1,4,Park,Margaret,Sales Support Agent,2,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
2,5,Johnson,Steve,Sales Support Agent,2,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com